verification/runs/T-family/T1_runs/D_Ts_Re25_U_f/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.20000000      0.0000000000      0.0000000000)
    (0.00000000      0.0000000000      0.0000000000)
    (1.00000000      0.0000000000      0.0000000000)
    (-0.20000000      0.0099904822      -0.0004361939)
    (0.00000000      0.0099904822      -0.0004361939)
    (1.00000000      0.0099904822      -0.0004361939)
    (-0.20000000      0.0099904822      0.0004361939)
    (0.00000000      0.0099904822      0.0004361939)
    (1.00000000      0.0099904822      0.0004361939)
);

blocks
(
    hex (0 1 4 3 0 1 7 6) (102 51 1) simpleGrading (1 1 1)
    hex (1 2 5 4 1 2 8 7) (510 51 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet          { type patch; faces ( (0 3 6 0) ); }
    outlet         { type patch; faces ( (2 5 8 2) ); }
    wall_adiabatic { type wall;  faces ( (3 4 7 6) ); }
    wall_hot       { type wall;  faces ( (4 5 8 7) ); }
    front          { type wedge; faces ( (0 1 7 6) (1 2 8 7) ); }
    back           { type wedge; faces ( (0 1 4 3) (1 2 5 4) ); }
    axis           { type empty; faces ( ); }
);

mergePatchPairs ();
