verification/runs/T-family/T1_runs/D_Ts_Re25_U_f/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.018749999999999999 0 0);
boundaryField
{
    inlet   { type fixedValue; value nonuniform List<vector>
51
(
(0.037491190758168896 0 0)
(0.037462713507242895 0 0)
(0.037405075551368669 0 0)
(0.037318583747454163 0 0)
(0.037203254109917129 0 0)
(0.037059089661473574 0 0)
(0.036886091302102256 0 0)
(0.036684259375929791 0 0)
...
)
; }
    outlet         { type zeroGradient; }
    wall_adiabatic { type noSlip; }
    wall_hot       { type noSlip; }
    front   { type wedge; }
    back    { type wedge; }
}
